{
  "date": "2025-12-07",
  "snapshot_generated_at": "2025-12-21T16:44:08.293161",
  "data": {
    "reddit": [
      {
        "title": "Pentagon announces it has killed four men in another boat strike in Pacific",
        "source": "r/worldnews"
      },
      {
        "title": "New US security strategy aligns with Russia's vision, Moscow says",
        "source": "r/worldnews"
      },
      {
        "title": "Goodbye, Microsoft: Schleswig-Holstein relies on Open Source and saves millions",
        "source": "r/europe"
      },
      {
        "title": "Kremlin hails Trump’s national security strategy as aligned with Russia’s vision",
        "source": "r/europe"
      },
      {
        "title": "U.S. Flips History by Casting Europe—Not Russia—as Villain in New Security Policy",
        "source": "r/europe"
      },
      {
        "title": "« We shouldn’t declare war against Russians » claimed French Left wing largest party leader JL Mélénchon",
        "source": "r/europe"
      },
      {
        "title": "Victoria passes controversial laws allowing life sentences for offenders as young as 14",
        "source": "r/worldnews"
      },
      {
        "title": "Macron wants european tariffs against China",
        "source": "r/StockMarket"
      },
      {
        "title": "Kremlin says new US security strategy accords largely with Russia's view",
        "source": "r/worldnews"
      },
      {
        "title": "Thoughts on my grandfather’s 27 year performance?",
        "source": "r/stocks"
      },
      {
        "title": "Russian Shadow Fleet Tanker Stuck off Bulgaria After Tugboat Abandons Tow",
        "source": "r/worldnews"
      },
      {
        "title": "Has anyone seen gold turn this color passes acid test.",
        "source": "r/Gold"
      },
      {
        "title": "Deadly attack on kindergarten reported in Sudan",
        "source": "r/worldnews"
      },
      {
        "title": "Best selling car models in France, Spain and Italy in November 2025",
        "source": "r/europe"
      },
      {
        "title": "Young people to lose benefits if they turn down work, says minister",
        "source": "r/europe"
      },
      {
        "title": "65€ worth of groceries in Tbilisi, Georgia",
        "source": "r/europe"
      },
      {
        "title": "Bulgaria joins the Eurozone fully in 3-4 weeks. What are your expectations short and long term? Travel, investments, stability, economy, integrity, etc?",
        "source": "r/europe"
      },
      {
        "title": "Benin coup attempt to oust President Talon foiled by loyalist troops, minister says",
        "source": "r/worldnews"
      },
      {
        "title": "Crypto investor Christopher Harborne donates record £9m to Reform UK",
        "source": "r/europe"
      },
      {
        "title": "Kids poured $70 million into the market in 2025. What they're buying.",
        "source": "r/economics"
      },
      {
        "title": "Japan’s Takaichi resurrects frozen dispute over islands lost to Russia",
        "source": "r/japan"
      },
      {
        "title": "Freedom of the press - America vs Europe",
        "source": "r/europe"
      },
      {
        "title": "Keep hitting US Big Tech with fines, Europe’s Greens tell von der Leyen",
        "source": "r/europe"
      },
      {
        "title": "X axes European Commission’s ad account after €120M EU fine",
        "source": "r/worldnews"
      },
      {
        "title": "Gold’s bubble behaviour may signal paradigm shift",
        "source": "r/economics"
      },
      {
        "title": "Farage turns on broadcasters over racism allegations as number of claims hits 28 | Nigel Farage",
        "source": "r/europe"
      },
      {
        "title": "Alexander Stubb: The West’s Last Chance (Foreign Affairs)",
        "source": "r/europe"
      },
      {
        "title": "Norway has the highest earners in Europe.",
        "source": "r/europe"
      },
      {
        "title": "X cancels EU's ad account as row worsens",
        "source": "r/europe"
      },
      {
        "title": "Farage turns on broadcasters over racism allegations as number of claims hits 28",
        "source": "r/worldnews"
      },
      {
        "title": "The full guide to switching from big US tech to supporting more ethical and EU-based companies! (Now with a website)",
        "source": "r/europe"
      },
      {
        "title": "Japan frustrated at Trump administration’s silence over row with China",
        "source": "r/geopolitics"
      },
      {
        "title": "Zelensky to visit London amid push for peace",
        "source": "r/worldnews"
      },
      {
        "title": "Sunday service, Belgrade",
        "source": "r/europe"
      },
      {
        "title": "Germany scrambles to unlock €165bn in frozen Russian assets for Ukraine",
        "source": "r/worldnews"
      },
      {
        "title": "Possible coup in Benin",
        "source": "r/worldnews"
      },
      {
        "title": "The two tiered economy is dangerous for all of us",
        "source": "r/economy"
      },
      {
        "title": "At least 25 people dead after major fire at nightclub in Goa, India",
        "source": "r/worldnews"
      },
      {
        "title": "Russia terminates military agreements with Portugal, France and Canada",
        "source": "r/worldnews"
      },
      {
        "title": "anyone buying the 3 oz thnickel?",
        "source": "r/Gold"
      },
      {
        "title": "There are a dire warnings from Nvidia CEO.",
        "source": "r/StockMarket"
      },
      {
        "title": "Venezuela’s Nobel Winner Will Go to Norway for Peace Prize, Official Says",
        "source": "r/worldnews"
      },
      {
        "title": "US Loses Financing Edge as Asia Borrows in Euros: Credit Weekly",
        "source": "r/StockMarket"
      },
      {
        "title": "Asim Munir Now In Control Of Pakistan's Nuclear Button",
        "source": "r/worldnews"
      },
      {
        "title": "10% a year returns… let’s just think about that for a second",
        "source": "r/investing"
      },
      {
        "title": "Is this 1943 10k gold class ring worth more in melt value or as an antique piece of jewelry?",
        "source": "r/Gold"
      },
      {
        "title": "/r/WorldNews Live Thread: Russian Invasion of Ukraine Day 1382, Part 1 (Thread )",
        "source": "r/worldnews"
      },
      {
        "title": "Wall Street Banks Bet on Double-Digit Rally to US Stocks in 2026",
        "source": "r/economics"
      },
      {
        "title": "UK IVF couples use legal loophole to rank embryos based on potential IQ, height and health",
        "source": "r/worldnews"
      },
      {
        "title": "NATO fighters scrambled in Poland as Russia bombards Ukraine",
        "source": "r/worldnews"
      },
      {
        "title": "Does Europe Finally Realize It’s Alone?",
        "source": "r/europe"
      },
      {
        "title": "Australia expects platforms to \"stop under-16s from using VPNs\" to evade social media ban",
        "source": "r/worldnews"
      },
      {
        "title": "The most likely solution to the U.S. debt crisis is severe austerity triggered by a fiscal calamity, former White House economic adviser says",
        "source": "r/economy"
      },
      {
        "title": "The European Commission levied a €120 million fine on X for breaches under the Digital Services Act, comprising penalties of €45 million (for ‘blue tick’ verification badge practices), €35 million (lack of transparency over advertising and scams), and €40 million (denial of researcher data access).",
        "source": "r/europe"
      },
      {
        "title": "Chinese jets directed fire-control radar at Japanese aircraft, Japan says",
        "source": "r/worldnews"
      },
      {
        "title": "\"The US continues to buy nuclear fuel from us for their nuclear power plants.\" - Putin",
        "source": "r/worldnews"
      },
      {
        "title": "Surging gas prices worsen affordability crisis for Americans",
        "source": "r/economics"
      },
      {
        "title": "US Promises Pre-Christmas Arms Boost for Ukraine, Pushes for Europe-Led NATO by 2027",
        "source": "r/worldnews"
      },
      {
        "title": "He means it guys! He’s not kidding!!!",
        "source": "r/europe"
      },
      {
        "title": "Is T (ATT) the dumbest company in the universe?",
        "source": "r/wallstreetbets"
      },
      {
        "title": "Senior US diplomat calls EU policies bad for trans-Atlantic partnership",
        "source": "r/europe"
      }
    ]
  }
}