{
  "date": "2025-12-06",
  "snapshot_generated_at": "2025-12-21T16:44:08.290849",
  "data": {
    "news": [
      {
        "category": "market",
        "title": "1 Risky ETF You Want to Avoid Buying in December",
        "ticker": "QQQ"
      }
    ],
    "reddit": [
      {
        "title": "Up to 8,000 people could need hospital care before flu wave reaches peak, health leaders warn",
        "source": "r/worldnews"
      },
      {
        "title": "Sleep On It, The Press Already Did — Biden’s aging was a national emergency, Trump’s naps, narco pardons and MRI mysteries became just another day at the office.",
        "source": "r/economy"
      },
      {
        "title": "Britain's nuclear submarine fleet ''no longer fit for purpose''",
        "source": "r/europe"
      },
      {
        "title": "Gold buyers, how do you verify large pieces?",
        "source": "r/Gold"
      },
      {
        "title": "Ukraine will not accept any peace deal requiring territorial concessions, Syrskyi tells UK broadcaster",
        "source": "r/worldnews"
      },
      {
        "title": "Russia unleashes massive drone and missile attack on Ukraine | CBC News",
        "source": "r/worldnews"
      },
      {
        "title": "Ukraine’s Intelligence Hackers Cripple Major Russian Logistics Network",
        "source": "r/worldnews"
      },
      {
        "title": "Who will win the AI race- only one Hyperscaler or all of them?",
        "source": "r/stocks"
      },
      {
        "title": "In Jan 2025 I invested in 11 stocks because of reddit. Here's how it went",
        "source": "r/stocks"
      },
      {
        "title": "French Thundart Rocket Unveiled As Longer-Range Alternative To HIMARS",
        "source": "r/europe"
      },
      {
        "title": "Christmas Gift-Bringers of Europe - who will visit you soon?",
        "source": "r/europe"
      },
      {
        "title": "Trump says Biden to blame for affordability crisis: ‘I’M FIXING IT’",
        "source": "r/economy"
      },
      {
        "title": "More Americans say Trump has helped raise prices rather than lower them: Survey",
        "source": "r/economics"
      },
      {
        "title": "At least 18 migrants die as inflatable boat sinks off Greek island of Crete",
        "source": "r/worldnews"
      },
      {
        "title": "According to Hungarian propaganda Germans are freezing to death, as they are not allowed to use gas heating due to the \"climate change craze\"",
        "source": "r/europe"
      },
      {
        "title": "Largest Corporate bankruptcy in US",
        "source": "r/stocks"
      },
      {
        "title": "U.S. consumers are so financially strained they put more than $1 billion on buy-now, pay later services during Black Friday and Cyber Monday",
        "source": "r/economics"
      },
      {
        "title": "Notre-Dame breaks its records: more than 11 million visitors in one year since the reopening.",
        "source": "r/europe"
      },
      {
        "title": "Millionaires in America: How common is it to have a 7-figure net worth?",
        "source": "r/economy"
      },
      {
        "title": "Average price of rice in Japan hits new record high",
        "source": "r/worldnews"
      },
      {
        "title": "Robinhood froze my ~$160k account 18+ months ago after misreading a police email",
        "source": "r/investing"
      },
      {
        "title": "White House: Europe 'unrecognisable in 20 years or less'",
        "source": "r/europe"
      },
      {
        "title": "Berkshire Hathaway is on track to lag behind the S&amp;P 500 in Buffett’s last year as CEO",
        "source": "r/StockMarket"
      },
      {
        "title": "EU’s Kallas calls US “biggest ally” despite critical security strategy",
        "source": "r/worldnews"
      },
      {
        "title": "How much is DeepMind actually worth?",
        "source": "r/stocks"
      },
      {
        "title": "Musk threatens ‘response’ against individuals who imposed €120M X penalty - The tech billionaire blasted “EU woke Stasi commissars” in posts on his social media platform, X.",
        "source": "r/europe"
      },
      {
        "title": "Elon Musk says EU should be abolished after X slapped with $140 million fine",
        "source": "r/europe"
      },
      {
        "title": "Chernobyl radiation shield has stopped working after Russian drone strikes, UN warns",
        "source": "r/worldnews"
      },
      {
        "title": "‘We Are Looking at a Massive Crisis’: Health-care costs are about to spike in a way that Americans can’t afford.",
        "source": "r/economy"
      },
      {
        "title": "China warns foreign media in Hong Kong over fire coverage",
        "source": "r/worldnews"
      },
      {
        "title": "Von der Leyen, Merz: Talks with Belgium over the potential use of billions in frozen Russian assets to fund Ukraine were ‘constructive’.",
        "source": "r/worldnews"
      },
      {
        "title": "Syrian president says Israel is ‘fighting ghosts’ and must abide by deconfliction accord",
        "source": "r/worldnews"
      },
      {
        "title": "Pick your 3 growth stocks for 2026",
        "source": "r/investing"
      },
      {
        "title": "Trump Tried to Brag About Black Friday. The Truth is Far More Grim. A closer look at sales data gives a much darker picture of the economy.",
        "source": "r/economy"
      },
      {
        "title": "Queer-hating violence in Bremen: Man assaults two young women on a tram",
        "source": "r/europe"
      },
      {
        "title": "ICC: Putin arrest warrant will stand even if Moscow and Kyiv reach amnesty agreement",
        "source": "r/europe"
      },
      {
        "title": "Four arrested after Tower of London display case containing State Crown defaced",
        "source": "r/worldnews"
      },
      {
        "title": "Putin Lives by a Code Trump Doesn’t Understand",
        "source": "r/geopolitics"
      },
      {
        "title": "2/3 of Slovakia wants Fico to resign, poll says",
        "source": "r/europe"
      },
      {
        "title": "U.K. sanctions British Sikh businessman, group over pro-Khalistan terrorism in India",
        "source": "r/worldnews"
      },
      {
        "title": "Carvana jumps 10% after-hours as it’s set to join S&amp;P 500 in rebalancing",
        "source": "r/StockMarket"
      },
      {
        "title": "Berkshire is on track to lag behind the S&amp;P 500 in Buffett's last year as CEO",
        "source": "r/stocks"
      },
      {
        "title": "New poster campaign for a foundation supported by the Hungarian government, it says “They raise taxes and spend your money on gold toilets.”",
        "source": "r/europe"
      },
      {
        "title": "Finland's Independence Day, country's 108th year of independence.",
        "source": "r/europe"
      },
      {
        "title": "Trans women will not be allowed to attend main Labour Women's Conference events",
        "source": "r/europe"
      },
      {
        "title": "Plans for direct UK–Germany rail link one step closer",
        "source": "r/europe"
      },
      {
        "title": "Bad news: Hungary downgraded to negative by top credit rating agency. Fitch Ratings has downgraded Hungary’s outlook from stable to negative, keeping the country just one notch above non-investment, or “junk”, grade",
        "source": "r/europe"
      },
      {
        "title": "How the dollar-store industry overcharges cash-strapped customers while promising low prices",
        "source": "r/economics"
      },
      {
        "title": "No calls, emails beyond official work hours: Right to Disconnect Bill introduced in Indian Parliament",
        "source": "r/worldnews"
      },
      {
        "title": "Sweden: New dating manual will encourage guys to break their loneliness",
        "source": "r/europe"
      },
      {
        "title": "Canada drops terror sanctions on Syria and its interim government",
        "source": "r/worldnews"
      },
      {
        "title": "Known as the Iron Harvest, farmers are still finding huge amounts of unexploded ordnance in France and Belgium left over from WW1 and WW2. Here's a field near Ypres.",
        "source": "r/europe"
      },
      {
        "title": "Hearings in absentia 'conceivable' for Putin and Netanyahu, ICC says",
        "source": "r/europe"
      },
      {
        "title": "Good day betting on Nasdaq futures &amp; NY Central Park temperatures",
        "source": "r/wallstreetbets"
      },
      {
        "title": "Christmas market in Warsaw (Poland)",
        "source": "r/europe"
      },
      {
        "title": "A bakery in Belgrade",
        "source": "r/europe"
      },
      {
        "title": "China to provide $100 million humanitarian aid for Gaza",
        "source": "r/China"
      },
      {
        "title": "Germany: Manufacturing orders rise 1,5 percent in October [“The positive trend in new orders is largely attributable to the increase recorded in the construction of aircraft, ships, trains and military vehicles\"]",
        "source": "r/europe"
      },
      {
        "title": "SpaceX aims for $800 billion valuation in secondary share sale, WSJ reports",
        "source": "r/StockMarket"
      },
      {
        "title": "Bank of America Authorizes 15,000 Advisors to Pitch Bitcoin; CIO Sets '1-4% Allocation' Standard",
        "source": "r/economics"
      },
      {
        "title": "ASF-infected boar carcass was deliberately dumped and may be “eastern sabotage”, says Poland",
        "source": "r/europe"
      },
      {
        "title": "US Urged Europeans to Oppose EU Plan for Loan to Support Ukraine",
        "source": "r/worldnews"
      },
      {
        "title": "Bombed Chornobyl shelter no longer blocks radiation and needs major repair – IAEA",
        "source": "r/worldnews"
      },
      {
        "title": "Down More Than 60% From Its High, Is Strategy MSTR Dip a cheap buy?",
        "source": "r/stocks"
      },
      {
        "title": "Berlin: Police can secretly enter homes for state trojan installation",
        "source": "r/worldnews"
      },
      {
        "title": "Congratulations Finland!",
        "source": "r/europe"
      },
      {
        "title": "Investigation: Secret visits to Moscow by China’s military expose deep defense cooperation, military procurement deals",
        "source": "r/europe"
      },
      {
        "title": "Giving up territory would be 'unjust peace', says Ukraine's armed forces chief",
        "source": "r/worldnews"
      },
      {
        "title": "Why Fears of a Trillion-Dollar AI Bubble Are Growing",
        "source": "r/economics"
      },
      {
        "title": "How Russia keeps raising an army to replace its dead",
        "source": "r/europe"
      },
      {
        "title": "/r/WorldNews Live Thread: Russian Invasion of Ukraine Day 1381, Part 1 (Thread )",
        "source": "r/worldnews"
      },
      {
        "title": "‘Superbugs’ surge to record levels in South Korea, with infections near 45,000",
        "source": "r/worldnews"
      },
      {
        "title": "Is this real? What it worth",
        "source": "r/Gold"
      },
      {
        "title": "Nearly 4 million new manufacturing jobs are coming to America as boomers retire—but it's the one trade job Gen Z doesn't want | Fortune",
        "source": "r/economics"
      },
      {
        "title": "Judge says referendum proposal on Alberta independence would be unconstitutional",
        "source": "r/worldnews"
      },
      {
        "title": "Putin in India: \"Mahatma Gandhi's message of peace and non-violence remains timeless.\"",
        "source": "r/europe"
      },
      {
        "title": "Millionaire tax that inspired Mamdani fuels $5.7 billion haul in Massachusetts",
        "source": "r/economics"
      },
      {
        "title": "China’s scientific clout is growing as US influence wanes: the data show how",
        "source": "r/economics"
      },
      {
        "title": "CVNA added to S&amp;P 🤡🤡🤡[previous post deleted]",
        "source": "r/wallstreetbets"
      }
    ]
  }
}