{
  "date": "2025-12-21",
  "snapshot_generated_at": "2025-12-22T19:34:37.121970",
  "data": {
    "news": [
      {
        "category": "gold",
        "title": "BlackRocks IBIT Defies Bitcoin Slump to Beat Gold in 2025 ETF Flows",
        "ticker": "GLD"
      },
      {
        "category": "market",
        "title": "BlackRocks IBIT Defies Bitcoin Slump to Beat Gold in 2025 ETF Flows",
        "ticker": "QQQ"
      },
      {
        "category": "gold",
        "title": "Analyst who predicted record gold prices resets target",
        "ticker": "GLD"
      },
      {
        "category": "gold",
        "title": "Analyst who predicted gold rally sets shocking new price target",
        "ticker": "GLD"
      },
      {
        "category": "market",
        "title": "Buying These 3 Perfect ETFs Could Make You a Millionaire Retiree",
        "ticker": "QQQ"
      }
    ],
    "reddit": [
      {
        "title": "Japan prepares to restart world's biggest nuclear plant, 15 years after Fukushima",
        "source": "r/worldnews"
      },
      {
        "title": "Poland says Ukrainian refugees contribute more than they cost",
        "source": "r/europe"
      },
      {
        "title": "Trump strikes deal with US drugmakers to cut Medicaid medicine costs",
        "source": "r/economy"
      },
      {
        "title": "Fed’s Hammack says there’s no need to change interest rates for months, WSJ reports",
        "source": "r/wallstreetbets"
      },
      {
        "title": "Russia war costs exceed $195 billion in 2025",
        "source": "r/europe"
      },
      {
        "title": "What Are Your Moves Tomorrow, December 22, 2025",
        "source": "r/wallstreetbets"
      },
      {
        "title": "Billionaire David Bateman has bought 1.5% of the 2025 silver output and just posted this on X",
        "source": "r/economy"
      },
      {
        "title": "Thousands cheer as the sun rises on winter solstice at Stonehenge",
        "source": "r/worldnews"
      },
      {
        "title": "U.S. Coast Guard 'in active pursuit' of third vessel off the Venezuelan coast",
        "source": "r/worldnews"
      },
      {
        "title": "US pursuing third oil tanker near Venezuela, officials say",
        "source": "r/worldnews"
      },
      {
        "title": "Portugal pledges $52 million for Ukraine arms via US purchase mechanism",
        "source": "r/worldnews"
      },
      {
        "title": "Saab boss Micael Johansson: We're ready for a joint future combat aircraft with the Germans",
        "source": "r/europe"
      },
      {
        "title": "‘Hamas operative’ behind group organising pro-Palestine marches",
        "source": "r/geopolitics"
      },
      {
        "title": "Can anyone explain me why capital gains tax is only about 20% while W2 wages are taxed at a top rate of almost 40%?",
        "source": "r/economy"
      },
      {
        "title": "Israel approves 19 new settlements in occupied West Bank",
        "source": "r/worldnews"
      },
      {
        "title": "France to build large new nuclear aircraft carrier",
        "source": "r/worldnews"
      },
      {
        "title": "France's EDF raises cost estimate for building six new nuclear reactors to 72.8 billion euros",
        "source": "r/worldnews"
      },
      {
        "title": "EVs Take 32.9% Share [in new registrations] In France - Renault 5 Record Volume",
        "source": "r/europe"
      },
      {
        "title": "NATO chief, in an interview with Bild, said several European countries are ready to deploy troops to Ukraine to help maintain peace and respond if Russia breaches a potential peace agreement",
        "source": "r/worldnews"
      },
      {
        "title": "Dutch entrepreneur turned down $500 million and now wants to win the AI race himself",
        "source": "r/europe"
      },
      {
        "title": "Major WA state coin show cancelled due to sales tax on bullion",
        "source": "r/Gold"
      },
      {
        "title": "During the pandemic, the Fed expanded the M2 money supply by 40%. Naturally, house prices increased by 40% - which is why we have an \"affordability crisis\"",
        "source": "r/economy"
      },
      {
        "title": "U.S. Pitches ‘Project Sunrise’ Plan to Turn Gaza Into High-Tech Metropolis",
        "source": "r/geopolitics"
      },
      {
        "title": "SA is now Israel's largest coal supplier, following Colombia's ban",
        "source": "r/geopolitics"
      },
      {
        "title": "Polish president vetoes government bills raising taxes on alcoholic and sweet drinks",
        "source": "r/economics"
      },
      {
        "title": "“Not Being Considered”: Kremlin Rejects Russia–US–Ukraine Peace Meeting Idea",
        "source": "r/worldnews"
      },
      {
        "title": "Erdogan warns Israel, Greece and Cyprus: Turkey will defend its maritime rights",
        "source": "r/worldnews"
      },
      {
        "title": "Walmart sees shift in consumer behavior",
        "source": "r/economy"
      },
      {
        "title": "Russian forces take Ukrainian villagers across border, media says",
        "source": "r/worldnews"
      },
      {
        "title": "US Is Said to Board Third Tanker Off Venezuela as Tensions Mount",
        "source": "r/worldnews"
      },
      {
        "title": "Brazil's Lula hopes EU-Mercosur trade deal will be signed in January",
        "source": "r/europe"
      },
      {
        "title": "Thanks to this sub, I’ve gone down the stacking rabbit hole.",
        "source": "r/Gold"
      },
      {
        "title": "Ivanka Trump's husband presents $112.1 billion plan for beachside luxury resort on shattered ruins of Gaza",
        "source": "r/economy"
      },
      {
        "title": "The New German War Machine | Germany’s transformation into a military power is in full swing: confidential government documents reveal plans to channel billions into ammunition and controversial weapons systems. Is the country prepared for the consequences?",
        "source": "r/europe"
      },
      {
        "title": "Hong Kong billionaire Jimmy Lai tested China's limits. It cost him his freedom",
        "source": "r/China"
      },
      {
        "title": "LFGggggg QQQ Santa Rally 625 Call Jan 02 26",
        "source": "r/wallstreetbets"
      },
      {
        "title": "Macron says Europe will need to engage with Putin if US peace talks fail",
        "source": "r/worldnews"
      },
      {
        "title": "Analysis: Russia’s economy is struggling. But that won’t bring Putin to the negotiating table for years | CNN Business",
        "source": "r/europe"
      },
      {
        "title": "Steve Rosenberg for BBC News: I asked Vladimir Putin: “What future are you planning, are you building for your country?” Here’s his full reply.",
        "source": "r/europe"
      },
      {
        "title": "Russia’s Birth Rate Plunges to 200-Year Low—Putin Says Early Marriage Is the Answer",
        "source": "r/worldnews"
      },
      {
        "title": "When does the sun set in Europe's capitals during winter solstice?",
        "source": "r/europe"
      },
      {
        "title": "Swedish customs says it has boarded Russian ship in Swedish waters to conduct inspection",
        "source": "r/worldnews"
      },
      {
        "title": "Train punctuality per station in 7 European countries in 2025",
        "source": "r/europe"
      },
      {
        "title": "Russia Is Mass-Producing 1000-km Iskander Missiles That Can Reach Most of Europe, Leaks Reveal",
        "source": "r/worldnews"
      },
      {
        "title": "Do you usually wait for a dip, or are you strictly “time in the market beats timing the market”?",
        "source": "r/stocks"
      },
      {
        "title": "Australia honours Bondi Beach attack victims; PM Albanese booed",
        "source": "r/worldnews"
      },
      {
        "title": "Ukraine can’t afford its 800,000-strong army alone: Zelenskyy says allied funding is now post-war security guarantee",
        "source": "r/europe"
      },
      {
        "title": "Investigation: Sick Ukrainian children exploited in fraudulent charity campaigns linked to US, Israel",
        "source": "r/worldnews"
      },
      {
        "title": "World’s Calmest Stock Market Challenges Options Traders in India - Bloomberg reports",
        "source": "r/stocks"
      },
      {
        "title": "US intelligence indicates Putin's war aims in Ukraine are unchanged",
        "source": "r/europe"
      },
      {
        "title": "Danish postal service to stop delivering letters after 400 years",
        "source": "r/europe"
      },
      {
        "title": "Merz tries to replace Macron at the helm of Europe",
        "source": "r/europe"
      },
      {
        "title": "Whats the catch? Investing in SPY and forgetting about it for X years",
        "source": "r/investing"
      },
      {
        "title": "Lepa Radić, a Seventeen-Year-Old Yugoslav Partisan and Anti-Fascist Resistance Fighter, Moments Before Her Execution by Nazi Forces for Refusing to Betray Her Comrades",
        "source": "r/europe"
      },
      {
        "title": "On this day 36 years ago the Romanian Revolution spread to Bucharest &amp; the rest of the country after a failed televized condamnation speech by dictator Nicolae Ceaușescu",
        "source": "r/europe"
      },
      {
        "title": "Rubio says U.S. to work with China without hurting ties with Japan",
        "source": "r/worldnews"
      },
      {
        "title": "This is my first gold purchase. 10 karat 10.7 gram broken rope chain. I bought it for $450 melt is $622. This is good right",
        "source": "r/Gold"
      },
      {
        "title": "/r/WorldNews Live Thread: Russian Invasion of Ukraine Day 1396, Part 1 (Thread )",
        "source": "r/worldnews"
      },
      {
        "title": "Canada sees increase in birth tourism, new data suggests",
        "source": "r/worldnews"
      },
      {
        "title": "Russia Withdraws from Several Military Agreements with European Countries",
        "source": "r/worldnews"
      },
      {
        "title": "Portfolio recommendations 2026-2030",
        "source": "r/stocks"
      },
      {
        "title": "Jim Beam Whiskey will shut its distillery for 2026 thanks to plummeting sales amid retaliatory tariffs from the European Union after Trump's tariffs and a bourbon boycott from Canada.",
        "source": "r/economy"
      },
      {
        "title": "Retirement...is it achievable with the cost of living these days? Asking on behalf of someone who will never touch $100k per year with their career. Is investing my only hope to do this?",
        "source": "r/investing"
      },
      {
        "title": "PCT $120k YOLO - I’ve been early before",
        "source": "r/wallstreetbets"
      },
      {
        "title": "Imran Khan’s solitary confinement &amp; inhumane detention conditions must end: UN expert",
        "source": "r/worldnews"
      },
      {
        "title": "Jobs Could Soon Replace Prices as Focus of Anxiety",
        "source": "r/economics"
      },
      {
        "title": "U.S. forces stop a 2nd merchant vessel off Venezuela coast, officials say",
        "source": "r/economics"
      },
      {
        "title": "Brazil's Lula warns military action in Venezuela would be 'humanitarian catastrophe'",
        "source": "r/geopolitics"
      },
      {
        "title": "Brazil's Lula warns US intervention in Venezuela could be catastrophic",
        "source": "r/worldnews"
      },
      {
        "title": "Do you think Alphabet will keep waymo or spin it off?",
        "source": "r/stocks"
      },
      {
        "title": "World Bank approves $700 million for Pakistan’s economic stability",
        "source": "r/worldnews"
      }
    ]
  }
}