{
  "date": "2025-11-16",
  "snapshot_generated_at": "2025-11-21T11:38:25.497561",
  "data": {
    "reddit": [
      {
        "title": "Peter Thiel’s latest 13F shows a full exit from Nvidia (NVDA)",
        "source": "r/stocks"
      },
      {
        "title": "Next Weeks Earnings Without Background Noise...",
        "source": "r/wallstreetbets"
      },
      {
        "title": "What Are Your Moves Tomorrow, November 17, 2025",
        "source": "r/wallstreetbets"
      },
      {
        "title": "A Surge in Islamism Widens Rift Between Sudanese Army and Its Regional Allies",
        "source": "r/geopolitics"
      },
      {
        "title": "Bessent: China magnet deal incoming by Thanksgiving",
        "source": "r/StockMarket"
      },
      {
        "title": "Trump tariffs panned by Bernanke, Yellen in Supreme Court filing",
        "source": "r/economics"
      },
      {
        "title": "Chinese coast guard sails toward Senkaku islands",
        "source": "r/japan"
      },
      {
        "title": "“Billionaires are only rich on paper bc if they sell, the stock value will tank” meanwhile…",
        "source": "r/StockMarket"
      },
      {
        "title": "The militias battling to form a breakaway coastal state in the Middle East",
        "source": "r/geopolitics"
      },
      {
        "title": "Record number of subprime borrowers miss car loan payments in October, data shows",
        "source": "r/economics"
      },
      {
        "title": "White House Hunts for Ways to Lower the Cost of Living",
        "source": "r/economics"
      },
      {
        "title": "Are ya at peak exuberance yet son??",
        "source": "r/StockMarket"
      },
      {
        "title": "Trump's GOP insists no affordability crisis after election losses",
        "source": "r/economics"
      },
      {
        "title": "China's unemployed Gen Z are proudly calling themselves 'rat people' and spending entire days in bed",
        "source": "r/China"
      },
      {
        "title": "Does the U.S. have a 'K-shaped economy'? What it means for you.",
        "source": "r/economics"
      },
      {
        "title": "Which asset class will have the most asymmetric returns in the next decade?",
        "source": "r/investing"
      },
      {
        "title": "The France National Intelligence Strategy 2025",
        "source": "r/geopolitics"
      },
      {
        "title": "Why have China’s exports held up so well under higher US tariffs?",
        "source": "r/economics"
      },
      {
        "title": "Elon Musk Is Late Again… Meanwhile China Just Delivered a Whole Robot Army",
        "source": "r/investing"
      },
      {
        "title": "Who else trades using no indicators or signals???",
        "source": "r/wallstreetbets"
      },
      {
        "title": "Stocks, not homeownership, is the primary wealth driver",
        "source": "r/stocks"
      },
      {
        "title": "Meta's CMO says Big Tech's soaring spending on AI is 'aggressive, but not crazy'",
        "source": "r/stocks"
      },
      {
        "title": "Japan urges China to scale back response in Taiwan row – DW",
        "source": "r/japan"
      },
      {
        "title": "Japan retail rice price hits record high since gov't release eased",
        "source": "r/japan"
      },
      {
        "title": "I want to stop max contributing to 401k. Am I wrong?",
        "source": "r/investing"
      },
      {
        "title": "There's still 'no evidence' China is buying all the U.S. soybeans it promised under Trump's trade deal amid oversupply from South America | Fortune",
        "source": "r/geopolitics"
      },
      {
        "title": "Trump buys at least $82 million in bonds since late August, disclosures show",
        "source": "r/economics"
      },
      {
        "title": "'The worst possible situation': This major city only has a few days of water left",
        "source": "r/geopolitics"
      }
    ]
  }
}