{
  "date": "2025-11-19",
  "snapshot_generated_at": "2025-11-21T11:38:25.505716",
  "data": {
    "fundamentals": {
      "HY_CREDIT_SPREAD": 3.17
    },
    "xauusd": {
      "open": 4067.85,
      "high": 4132.68,
      "low": 4055.25,
      "close": 4075.84
    },
    "economic_events": [
      {
        "time": "14:30",
        "currency": "USD",
        "event": "Exports  (Aug)",
        "actual": "280.80B",
        "forecast": "",
        "previous": "280.50B"
      },
      {
        "time": "14:30",
        "currency": "USD",
        "event": "Imports  (Aug)",
        "actual": "340.40B",
        "forecast": "",
        "previous": "358.80B"
      },
      {
        "time": "14:30",
        "currency": "USD",
        "event": "Trade Balance  (Aug)",
        "actual": "-59.60B",
        "forecast": "-61.30B",
        "previous": "-78.20B"
      },
      {
        "time": "16:30",
        "currency": "USD",
        "event": "Atlanta Fed GDPNow  (Q4)",
        "actual": "4.2%",
        "forecast": "4.0%",
        "previous": "4.0%"
      },
      {
        "time": "16:30",
        "currency": "USD",
        "event": "Crude Oil Inventories",
        "actual": "-3.426M",
        "forecast": "-0.600M",
        "previous": "6.413M"
      },
      {
        "time": "16:30",
        "currency": "USD",
        "event": "Cushing Crude Oil Inventories",
        "actual": "-0.698M",
        "forecast": "",
        "previous": "-0.346M"
      },
      {
        "time": "19:00",
        "currency": "USD",
        "event": "20-Year Bond Auction",
        "actual": "4.706%",
        "forecast": "",
        "previous": "4.506%"
      },
      {
        "time": "21:30",
        "currency": "USD",
        "event": "CFTC Crude Oil speculative net positions",
        "actual": "103.3K",
        "forecast": "",
        "previous": "103.0K"
      },
      {
        "time": "21:30",
        "currency": "USD",
        "event": "CFTC Gold speculative net positions",
        "actual": "252.9K",
        "forecast": "",
        "previous": "266.7K"
      },
      {
        "time": "21:30",
        "currency": "USD",
        "event": "CFTC Nasdaq 100 speculative net positions",
        "actual": "41.0K",
        "forecast": "",
        "previous": "23.4K"
      },
      {
        "time": "21:30",
        "currency": "USD",
        "event": "CFTC S&P 500 speculative net positions",
        "actual": "-136.7K",
        "forecast": "",
        "previous": "-172.5K"
      }
    ],
    "news": [
      {
        "category": "market",
        "title": "Will the Fed Cut, or Wont It? This ETF Move Works Either Way.",
        "ticker": "SPY"
      },
      {
        "category": "market",
        "title": "Will the Fed Cut, or Won't It? This ETF Move Works Either Way.",
        "ticker": "IWM"
      },
      {
        "category": "gold",
        "title": "Gold Under Pressure as Rate-Cut Hopes Fade: Time to Buy the Dip?",
        "ticker": "GLD"
      },
      {
        "category": "dollar",
        "title": "Gold Under Pressure as Rate-Cut Hopes Fade: Time to Buy the Dip?",
        "ticker": "UUP"
      },
      {
        "category": "market",
        "title": "If You'd Invested $1,000 in the Invesco QQQ Trust ETF 5 Years Ago, Here's How Much You'd Have Today",
        "ticker": "QQQ"
      },
      {
        "category": "gold",
        "title": "Gold Comfortably Outperforms Market YTD: ETFs to Consider",
        "ticker": "GLD"
      },
      {
        "category": "market",
        "title": "U.S. Outperformance in Sight? ETFs to Play Morgan Stanley's Forecast",
        "ticker": "SPY"
      },
      {
        "category": "market",
        "title": "Stock Market Today: Dow Rises Ahead Of Fed Minutes; Nvidia Rallies With Earnings On The Way (Live Coverage)",
        "ticker": "SPY"
      },
      {
        "category": "market",
        "title": "Stock Market Today: Dow Wobbles Ahead Of Fed Minutes; Nvidia Rallies With Earnings On The Way (Live Coverage)",
        "ticker": "SPY"
      },
      {
        "category": "market",
        "title": "Tapbit Marks 4th Anniversary with Continued Focus on Innovation and User Trust",
        "ticker": "SPY"
      },
      {
        "category": "market",
        "title": "Small-Cap Stocks Are Sounding a Very Scary Alarm. Heres How to Protect Yourself and Even Profit.",
        "ticker": "IWM"
      },
      {
        "category": "market",
        "title": "The Clear Winner for Building Long Term Wealth, QQQ or VTI?",
        "ticker": "QQQ"
      },
      {
        "category": "market",
        "title": "Stocks Shoot Higher in After-Hours Trading on Nvidia Earnings",
        "ticker": "SPY"
      },
      {
        "category": "market",
        "title": "Nvidia Earnings Send Stocks Higher",
        "ticker": "SPY"
      }
    ],
    "reddit": [
      {
        "title": "US Govt approves sale of NVDA chips to Middle East",
        "source": "r/wallstreetbets"
      },
      {
        "title": "How to do 0dte after market close 101",
        "source": "r/wallstreetbets"
      },
      {
        "title": "Nvidia Crushes Estimates with Record Revenue, Forecasts Strong Holiday Quarter",
        "source": "r/investing"
      },
      {
        "title": "Nvidia earnings clear lofty hurdle set by analysts amid fear about an AI bubble",
        "source": "r/economics"
      },
      {
        "title": "‘Shameful’: Russia removes Polish symbols from Katyn massacre cemetery",
        "source": "r/europe"
      },
      {
        "title": "Nvidia stock soars after results, forecasts top estimates with sales for AI chips 'off the charts'",
        "source": "r/StockMarket"
      },
      {
        "title": "UN to hear human rights complaint over New Zealand’s treatment of Māori",
        "source": "r/worldnews"
      },
      {
        "title": "NVDA Quarterly Revenue $57 billion (up 62% YoY)",
        "source": "r/stocks"
      },
      {
        "title": "Nvidia shares rise on stronger than expected revenue, forecast",
        "source": "r/stocks"
      },
      {
        "title": "Nvidia Beat Earnings And Raise Guidance, as usual",
        "source": "r/wallstreetbets"
      },
      {
        "title": "NVDA Earnings with the Double Beat",
        "source": "r/wallstreetbets"
      },
      {
        "title": "After Shutdown, Labor Department Says Some Data is Gone for Good",
        "source": "r/economics"
      },
      {
        "title": "Trump's Transportation Secretary on how to improve air travel: \"Sometimes you just have to ask people, Hey, let's go back to an era where we didn't wear our pajamas to the airport. We actually might dress up a little bit\"",
        "source": "r/economy"
      },
      {
        "title": "Gen Z expect to inherit money and assets—but their boomer parents aren’t planning on leaving anything behind | Fortune",
        "source": "r/economics"
      },
      {
        "title": "What Are Your Moves Tomorrow, November 20, 2025",
        "source": "r/wallstreetbets"
      },
      {
        "title": "UK to impose Trump-style migrant visa bans",
        "source": "r/worldnews"
      },
      {
        "title": "The U.S. Has Proposed That Ukraine Withdraw Its Troops From Donbas, Reduce the Size of Its Army, and Accept a Frozen Front Line in Exchange for Broad Security Guarantees. What Is Known About the Settlement Plan Washington Discussed With Moscow, Kyiv, and Its Allies",
        "source": "r/europe"
      },
      {
        "title": "US colleges see 17% drop in newly enrolled international students, report finds",
        "source": "r/economics"
      },
      {
        "title": "'China was playing chess while the rest of us were playing checkers': Bombshell study finds $200 billion of secret loans to U.S. businesses over 25 years",
        "source": "r/economy"
      },
      {
        "title": "'China ran fake image campaign against Rafale': US Commission's big revelation on India Pakistan clash",
        "source": "r/europe"
      },
      {
        "title": "\"It was just announced. We have more jobs right now than we've ever had in the history of our country. Those are big numbers. You know, it's like crazy. It's it's a great just a great stat.\" -- Donald Trump",
        "source": "r/economy"
      },
      {
        "title": "November jobs report pushed back due to shutdown",
        "source": "r/stocks"
      },
      {
        "title": "Hamas attacks IDF troops in breach of Gaza ceasefire; top commanders killed in response",
        "source": "r/worldnews"
      },
      {
        "title": "Top Italian court approves handover of Ukrainian Nord Stream suspect to Germany",
        "source": "r/europe"
      },
      {
        "title": "US and Russian officials draft new peace plan based on capitulation from Ukraine",
        "source": "r/europe"
      },
      {
        "title": "Quick Thoughts on Nvidia Earnings Today",
        "source": "r/investing"
      },
      {
        "title": "Trump: It was announced we have more jobs right now than we've ever had in the history of our country. Those are big numbers. It's crazy. It's a great stat. More jobs today than we have ever had in the history of our country.",
        "source": "r/economy"
      },
      {
        "title": "Fed minutes show divide over October rate cut and cast doubt about December",
        "source": "r/wallstreetbets"
      },
      {
        "title": "China Is the Weak Link in Europe’s Ukraine Strategy - China plays an increasingly active role in the Kremlin’s hybrid war against Europe. The EU must confront this growing China-Russia cooperation, as it poses grave threats to both European security and economic resilience.",
        "source": "r/europe"
      },
      {
        "title": "As corruption scandal hits, Zelensky's party lawmakers side with opposition, demand answers, powers",
        "source": "r/worldnews"
      },
      {
        "title": "Russian spy ship enters British waters and shines lasers at military pilots",
        "source": "r/worldnews"
      },
      {
        "title": "(NVDA) NVIDIA Q3 2026 Earnings Call | Live Transcript at 5:00pm ET",
        "source": "r/wallstreetbets"
      },
      {
        "title": "Germany confirms long-range missile delivery to Ukraine amid strategic shift",
        "source": "r/worldnews"
      },
      {
        "title": "Russian spy ship on course for Irish waters, with UK threatening ‘military options’",
        "source": "r/europe"
      },
      {
        "title": "Exclusive: Ukraine expected to give up land, some arms under US peace plan, sources say",
        "source": "r/europe"
      },
      {
        "title": "Mossad: Hamas expanding terror network across Europe | Spy agency cooperates with European intelligence and law enforcement to thwart Hamas terror plots targeting Israeli and Jewish sites; guns and explosives linked to a senior Hamas official’s son found hidden in cache in Austria",
        "source": "r/geopolitics"
      },
      {
        "title": "BLS says full October jobs data won’t be released, available figures to be included in next report",
        "source": "r/StockMarket"
      },
      {
        "title": "Trump: \"Tariffs have been, frankly, the best thing that's ever happened to our country\"",
        "source": "r/economy"
      },
      {
        "title": "U.S. trade deficit drops 24% in August as Trump's tariffs reduce imports",
        "source": "r/economics"
      },
      {
        "title": "US proposals to end Russia's war involve Ukraine giving up land, some weapons, sources say",
        "source": "r/worldnews"
      },
      {
        "title": "China to halt Japan seafood imports amid Taiwan spat – reports",
        "source": "r/japan"
      },
      {
        "title": "For legal reasons this is a joke",
        "source": "r/Gold"
      },
      {
        "title": "Mossad unveils network of Hamas terror infrastructure across Europe — According to the Mossad, coordinated raids in Austria and Germany resulted in arrests and the seizure of weapons and explosives intended for use “on command.”",
        "source": "r/worldnews"
      },
      {
        "title": "Is this gold? It seems to not have a stamp on it but is super shiny.",
        "source": "r/Gold"
      },
      {
        "title": "Age-verification laws don't keep minors off adult sites, study suggests | Mashable",
        "source": "r/europe"
      },
      {
        "title": "Rome fumes over ‘Italian-style’ food sold in EU Parliament shop",
        "source": "r/europe"
      },
      {
        "title": "Beware of JM Bullion",
        "source": "r/Gold"
      },
      {
        "title": "Activists driving across Brussels today calling on von der Leyen to break free from paralyzed national leaders and stand up to Washington",
        "source": "r/europe"
      },
      {
        "title": "Japanese reserve balances held by institutions subject to reserve requirements have fallen off a cliff - more than 50% down, to 2016 levels",
        "source": "r/stocks"
      },
      {
        "title": "Target cuts profit outlook as shoppers look for deals, make fewer store trips",
        "source": "r/StockMarket"
      },
      {
        "title": "Germany wakes up to US tech dominance - Paris and Berlin signal new united front on Europe’s technological independence.",
        "source": "r/economics"
      },
      {
        "title": "America’s labor market is cooling, and workers are quietly turning to Uber and DoorDash to fill the income gap",
        "source": "r/economics"
      },
      {
        "title": "Social Democrats in Denmark suffer sweeping election losses | Denmark",
        "source": "r/europe"
      },
      {
        "title": "US holding secret peace talks with Moscow to end Russia's war against Ukraine, Axios reports",
        "source": "r/worldnews"
      },
      {
        "title": "US revives jungle warfare training in Panama amid regional tensions",
        "source": "r/worldnews"
      },
      {
        "title": "British citizen under war-crimes investigation after filming pigs eat Ukrainian soldier",
        "source": "r/worldnews"
      },
      {
        "title": "Markwayne Mullin: \"Affordable healthcare doesn't work. The Democrats had a community organizer in President Obama that tried to sell us a bill of goods. It isn't working. So let's let a business guy that actually knows business help negotiate a healthcare for the American people.\"",
        "source": "r/economy"
      },
      {
        "title": "Gustav Klimt portrait sells for $236.4m, making it the second most expensive artwork ever sold at auction",
        "source": "r/worldnews"
      },
      {
        "title": "Gaza water provider suspends services after Hamas detains staff member",
        "source": "r/worldnews"
      },
      {
        "title": "Low-income Americans being priced out of McDonald’s and wider fast-food industry by soaring prices",
        "source": "r/economy"
      },
      {
        "title": "Target drops 2% pre-market after cutting full-year EPS outlook and warns of weak holiday demand as affordability crisis hits consumers",
        "source": "r/wallstreetbets"
      },
      {
        "title": "Moscow designates developer of S.T.A.L.K.E.R. video game series as ‘undesirable’ organisation",
        "source": "r/europe"
      },
      {
        "title": "Eight people ‘linked to Albanian mafia’ arrested over plot to kill Brussels’ chief prosecutor",
        "source": "r/europe"
      },
      {
        "title": "The Market is green because Nvidia can't miss the earning",
        "source": "r/StockMarket"
      },
      {
        "title": "Israeli figures warn state has ‘lost control’ as West Bank settlers attack",
        "source": "r/worldnews"
      },
      {
        "title": "Trump designates Saudi Arabia as major non-NATO ally in defense agreement",
        "source": "r/worldnews"
      },
      {
        "title": "On this day in 1581, Ivan the Terrible slays his son in a fit of rage, leading to The Time of Troubles where Russia suffered mass-famines and multiple miltary defeats.",
        "source": "r/europe"
      },
      {
        "title": "Vladimir Putin fears entering Russian history as the man who lost Ukraine",
        "source": "r/europe"
      },
      {
        "title": "Target announces partnership with OpenAI as it aims to reverse sales slump",
        "source": "r/wallstreetbets"
      },
      {
        "title": "Airbus chair calls on Europe to acquire tactical nuclear weapons",
        "source": "r/europe"
      },
      {
        "title": "Russian GRU agent linked to Novichok attack [in Salisbury, England] arrested [in Phuket, Thailand]",
        "source": "r/europe"
      },
      {
        "title": "Daily Discussion Thread for November 19, 2025",
        "source": "r/wallstreetbets"
      },
      {
        "title": "We're in the end game now.",
        "source": "r/wallstreetbets"
      },
      {
        "title": "'Beating heart of Europe': Belgian PM wants to make Benelux into one country. Belgium and the Netherlands becoming one country again, and potentially adding Luxembourg into the mix? The Belgian Prime Minister has repeatedly suggested it, and the Flemish Minister-President is up for it",
        "source": "r/europe"
      },
      {
        "title": "Quantum teleportation between photons from two distant light sources achieved",
        "source": "r/worldnews"
      },
      {
        "title": "Russian spy ship currently on edge of UK waters, warns defence secretary",
        "source": "r/worldnews"
      },
      {
        "title": "Oracle is already underwater on its ‘astonishing’ $300bn OpenAI deal",
        "source": "r/wallstreetbets"
      },
      {
        "title": "Europe must not cede digital sphere to US, China, warns Germany's Merz",
        "source": "r/europe"
      },
      {
        "title": "Internal documents: EU member states agree on voluntary chat control",
        "source": "r/europe"
      },
      {
        "title": "‘We are under attack’: Italian defense minister accuses russia of waging hybrid war",
        "source": "r/europe"
      },
      {
        "title": "Russia struck a high-rise in Ukraine’s Ternopil. At least nine people were killed.",
        "source": "r/europe"
      },
      {
        "title": "Ukrainian opposition blocks parliament, demands entire government resign over $100M scheme involving Zelenskyy’s associate",
        "source": "r/worldnews"
      },
      {
        "title": "Japanese minister calls Dokdo 'inherent part' of Japan after protests from Seoul over territory",
        "source": "r/japan"
      },
      {
        "title": "Heinrich Nordhoff and 30k employees behind him, Volkswagen plant at Wolfsburg 1955",
        "source": "r/europe"
      },
      {
        "title": "German Court Hits Google With €465m Fine for 15 Years of Search Power Abuse",
        "source": "r/europe"
      },
      {
        "title": "Pro-Russia former civil servant becomes first Brit to face Ukraine war crime charges over clip of pigs eating dead soldiers",
        "source": "r/europe"
      },
      {
        "title": "Developing | Beijing tells Tokyo it will suspend Japanese seafood imports: Kyodo News",
        "source": "r/worldnews"
      },
      {
        "title": "Toyota chairman Akio Toyoda wears MAGA shirt and hat to NASCAR event at Fuji Speedway",
        "source": "r/japan"
      },
      {
        "title": "Spain defends large Catalan banner in Madrid marking 50 years since end of dictatorship",
        "source": "r/europe"
      },
      {
        "title": "Tampa becomes foreclosure epicenter as Florida tops nation in housing distress",
        "source": "r/economics"
      },
      {
        "title": "Parasocial is named as Cambridge Dictionary Word of the Year",
        "source": "r/worldnews"
      },
      {
        "title": "Zelenskyy faces pressure to fire top aide Yermak amid corruption scandal",
        "source": "r/geopolitics"
      },
      {
        "title": "Change in national debt since Nov 14, 2024",
        "source": "r/economy"
      },
      {
        "title": "/r/WorldNews Live Thread: Russian Invasion of Ukraine Day 1364, Part 1 (Thread )",
        "source": "r/worldnews"
      },
      {
        "title": "Spain Pledges $710 Million in Military Aid to Ukraine",
        "source": "r/worldnews"
      },
      {
        "title": "U.S. Energy Secretary and Saudi Arabia's Energy Minister Announce Deal on Civil Nuclear Cooperation",
        "source": "r/worldnews"
      },
      {
        "title": "Saab can match U.S. F-35 deal for Canada: Swedish deputy PM",
        "source": "r/worldnews"
      },
      {
        "title": "How are Nvidia's earnings likely to affect the market?",
        "source": "r/investing"
      },
      {
        "title": "DJT Stock Has Cratered, Wiping Out More Than $5 Billion in Trump Family Wealth",
        "source": "r/economy"
      },
      {
        "title": "Canada announces massive jump in funding to European Space Agency",
        "source": "r/worldnews"
      },
      {
        "title": "Is Saylor about to crash MSTR again or is it different this time because of Bitcoin?",
        "source": "r/wallstreetbets"
      },
      {
        "title": "Do not fall in LOVE with a stock!",
        "source": "r/wallstreetbets"
      },
      {
        "title": "Goldman Sachs: Over 1.1 Million Layoffs in 2025 Push 15% of ‘Unemployed’ into Gig Work on Uber, DoorDash, and Instacart",
        "source": "r/StockMarket"
      },
      {
        "title": "oracle doesn't even believe in themselves",
        "source": "r/wallstreetbets"
      },
      {
        "title": "The Warning Signal That Preceded Every Crash Since 1929 Just Flashed Again.",
        "source": "r/economy"
      }
    ]
  }
}